### Selecting multiple columns in a pandas dataframe

In [37]:
import pandas as pd

In [38]:
train = pd.read_csv('train.csv')
train.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

#### Method 1

In [39]:
#Select 2 Columns - Name and Age
names = train[['Name','Age']]
names.head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

#### Method 2

In [40]:
#Extract Categorical Variables
categorical = [var for var in train.columns if train[var].dtype=='O']

In [41]:
#Extract Numerical Vairbles
numerical = [var for var in train.columns if train[var].dtype!='O']

In [42]:
print('Categorical variables - {}'.format(len(categorical)))
print('Numerical - {}'.format(len(numerical)))

Categorical variables - 5
Numerical - 7

In [44]:
categorical

['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']

In [45]:
df = train[categorical].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [46]:
numerical

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [47]:
train[numerical].head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500